Repository: DUGUSHUANGTAN/Romeo-Daily-Ledger
Catalog: RomeoDailyLedger/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# nav.categories.title
source: Categories
zh_hans: 分类
zh_hant: 分類

# ai.analysis.history
source: Analysis History
zh_hans: 分析历史
zh_hant: 分析歷史

# ai.analysis.history.empty
source: There is currently no analysis history
zh_hans: 当前没有分析历史
zh_hant: 目前沒有分析歷史

# ai.analysis.history.selectedCount
source: %lld selected
zh_hans: 已选择 %lld 条
zh_hant: 已選擇 %lld 條

# ai.analysis.history.selectionHint
source: Long-press an analysis to select and delete multiple records.
zh_hans: 长按分析记录可批量选择删除。
zh_hant: 長按分析記錄可批量選擇刪除。

# settings.ai.clearAnalysisHistory
source: Clear all analysis history
zh_hans: 清除全部分析历史
zh_hant: 清除全部分析歷史

# settings.ai.clearAnalysisHistory.confirmTitle
source: Clear analysis history?
zh_hans: 确认清除分析历史？
zh_hant: 確認清除分析歷史？

# settings.ai.clearAnalysisHistory.confirmMessage
source: All saved AI analysis history will be permanently deleted.
zh_hans: 所有已保存的 AI 分析历史都将被永久删除。
zh_hant: 所有已保存的 AI 分析歷史都將被永久刪除。

# button.delete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# calendar.dayBalance
source: Net %@
zh_hans: 净额 %@
zh_hant: 淨額 %@

# history.search.placeholder
source: Search history
zh_hans: 搜索历史账目
zh_hant: 搜尋歷史賬目

# history.title
source: History Entries
zh_hans: 历史账目
zh_hant: 歷史賬目

# nav.history.title
source: History
zh_hans: 历史
zh_hant: 歷史

# settings.ai.apiKey.hide
source: Hide API Key
zh_hans: 隐藏 API 密钥
zh_hant: 隱藏 API 密鑰

# settings.ai.apiKey.show
source: Show API Key
zh_hans: 显示 API 密钥
zh_hant: 顯示 API 密鑰

# settings.ai.deleteModel.message
source: This model preset will be permanently deleted.
zh_hans: 此模型预设将被永久删除。
zh_hant: 此模型預設將被永久刪除。

# settings.ai.deleteModel.title
source: Delete model?
zh_hans: 删除模型？
zh_hant: 刪除模型？

# settings.ai.modelProviderName
source: Preset name
zh_hans: 预设名称
zh_hant: 預設名稱

# settings.ai.models
source: Models
zh_hans: 模型
zh_hant: 模型

# settings.ai.checkModels
source: Check Models
zh_hans: 检测模型
zh_hant: 檢測模型

# settings.ai.models.hint
source: Fill in each provider's API key to use its models.
zh_hans: 填入各提供方的 API 密钥即可使用其模型。
zh_hant: 填入各提供方的 API 密鑰即可使用其模型。

# settings.ai.status.connected
source: Connected
zh_hans: 已连通
zh_hant: 已連通

# settings.ai.status.notConnected
source: Not connected
zh_hans: 未连通
zh_hant: 未連通

# settings.categories.add
source: Add category
zh_hans: 新增分类
zh_hant: 新增分類

# accessibility.categoryChart
source: Category amount and share bar chart
zh_hans: 分类金额与占比条形图
zh_hant: 分類金額與佔比條形圖

# accessibility.entryList
source: Entry list
zh_hans: 账目列表
zh_hant: 賬目列表

# accessibility.monthCalendar
source: Monthly calendar
zh_hans: 月历
zh_hant: 月曆

# accessibility.monthlyChart
source: Monthly income and expense bar chart
zh_hans: 月度收入与支出柱状图
zh_hant: 月度收入與支出柱狀圖

# accessibility.nextInsights
source: View next month's insights
zh_hans: 查看下个月统计
zh_hant: 查看下個月統計

# accessibility.notSelected
source: Not selected
zh_hans: 未选择
zh_hant: 未選擇

# accessibility.previousInsights
source: View previous month's insights
zh_hans: 查看上个月统计
zh_hant: 查看上個月統計

# accessibility.selected
source: Selected
zh_hans: 已选择
zh_hant: 已選擇

# accessibility.selectionSummary
source: Selection summary
zh_hans: 多选汇总
zh_hant: 多選匯總

# ai.analysis.end
source: End
zh_hans: 结束日期
zh_hant: 結束日期

# ai.analysis.permissionRequired
source: Enable ledger access in AI settings before analysis.
zh_hans: 分析前请在 AI 设置中允许读取账目。
zh_hant: 分析前請在 AI 設置中允許讀取賬目。

# ai.analysis.question
source: What would you like to know?
zh_hans: 你想了解哪些账目？
zh_hant: 你想瞭解哪些賬目？

# ai.analysis.result
source: Analysis
zh_hans: 分析结果
zh_hant: 分析結果

# ai.analysis.run
source: Analyze
zh_hans: 开始分析
zh_hant: 開始分析

# ai.analysis.scope
source: Authorized date range
zh_hans: 已授权的日期范围
zh_hant: 已授權的日期範圍

# ai.analysis.start
source: Start
zh_hans: 开始日期
zh_hant: 開始日期

# ai.error.apiKey
source: Save an API key in AI settings first.
zh_hans: 请先在 AI 设置中保存 API Key。
zh_hant: 請先在 AI 設置中保存 API Key。

# ai.error.baseURL
source: Enter a valid HTTPS API base URL.
zh_hans: 请输入有效的 HTTPS API Base URL。
zh_hant: 請輸入有效的 HTTPS API Base URL。

# ai.error.currency
source: The draft currency does not match the app currency.
zh_hans: 草稿币种与应用当前币种不一致。
zh_hant: 草稿幣種與應用當前幣種不一致。

# ai.error.decoding
source: The AI response could not be read.
zh_hans: 无法读取 AI 返回内容。
zh_hant: 無法讀取 AI 返回內容。

# ai.error.http
source: The AI service rejected the request.
zh_hans: AI 服务拒绝了请求。
zh_hant: AI 服務拒絕了請求。

# ai.error.invalidResult
source: The AI returned an invalid ledger draft.
zh_hans: AI 返回的记账草稿无效。
zh_hant: AI 返回的記賬草稿無效。

# ai.error.model
source: Enter a model name.
zh_hans: 请输入模型名称。
zh_hant: 請輸入模型名稱。

# ai.error.network
source: Unable to reach the AI service.
zh_hans: 无法连接 AI 服务。
zh_hant: 無法連接 AI 服務。

# ai.generate
source: Generate draft
zh_hans: 生成草稿
zh_hant: 生成草稿

# ai.loading
source: AI is analyzing…
zh_hans: AI 正在分析…
zh_hant: AI 正在分析…

# ai.mode.analysis
source: Analyze ledger
zh_hans: 账目分析
zh_hant: 賬目分析

# ai.mode.entry
source: Create entries
zh_hans: 智能记账
zh_hant: 智能記賬

# ai.permissionRequired
source: Ledger data access is disabled. Enable it in AI settings before analysis.
zh_hans: 账目数据读取已关闭。分析前请在 AI 设置中开启。
zh_hant: 賬目數據讀取已關閉。分析前請在 AI 設置中開啓。

# ai.preview.confirm
source: Confirm and save
zh_hans: 确认并保存
zh_hant: 確認並保存

# ai.preview.range
source: Only the described entries will be saved after confirmation.
zh_hans: 确认后才会保存以下草稿。
zh_hant: 確認後才會保存以下草稿。

# ai.preview.remove
source: Remove
zh_hans: 移除
zh_hant: 移除

# ai.preview.title
source: Review AI draft
zh_hans: 确认 AI 草稿
zh_hant: 確認 AI 草稿

# ai.prompt
source: For example: Lunch cost 25 USD
zh_hans: 例如：午餐花了 25 美元
zh_hant: 例如：午餐花了 25 美元

# ai.subtitle
source: Enter a ledger or analysis request.
zh_hans: 请输入账本或分析需求
zh_hant: 請輸入賬本或分析需求

# ai.title
source: AI Assistant
zh_hans: AI助手
zh_hant: AI助手

# app.name
source: Romeo Daily Ledger
zh_hans: 罗密欧每日记账
zh_hant: 羅密歐每日記賬

# app.version
source: Version %@
zh_hans: 版本 %@
zh_hant: 版本 %@

# menu.hideApp
source: Hide %@
zh_hans: 隐藏%@
zh_hant: 隱藏%@

# menu.hideOthers
source: Hide Others
zh_hans: 隐藏其他
zh_hant: 隱藏其他

# menu.services
source: Services
zh_hans: 服务
zh_hant: 服務

# menu.showAll
source: Show All
zh_hans: 全部显示
zh_hant: 全部顯示

# menu.quitApp
source: Quit %@
zh_hans: 退出%@
zh_hant: 結束%@

# menu.quitKeepWindows
source: Quit and Keep Windows
zh_hans: 退出并保留窗口
zh_hant: 結束並保留視窗

# button.back
source: Back
zh_hans: 返回
zh_hant: 返回

# button.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# button.cancelSelection
source: Cancel Selection
zh_hans: 取消选择
zh_hant: 取消選擇

# button.close
source: Close
zh_hans: 关闭
zh_hant: 關閉

# button.confirmDelete
source: Delete
zh_hans: 确认删除
zh_hant: 確認刪除

# button.deleteSelected
source: Delete Selected
zh_hans: 删除所选
zh_hant: 刪除所選

# button.done
source: Done
zh_hans: 完成
zh_hant: 完成

# button.editEntry
source: Edit Entry
zh_hans: 编辑账目
zh_hant: 編輯賬目

# button.manage
source: Manage
zh_hans: 管理
zh_hant: 管理

# button.nextMonth
source: Next Month
zh_hans: 下个月
zh_hant: 下個月

# button.previousMonth
source: Previous Month
zh_hans: 上个月
zh_hant: 上個月

# button.save
source: Save
zh_hans: 保存
zh_hant: 保存

# button.saveEntry
source: Save Entry
zh_hans: 保存账目
zh_hant: 保存賬目

# button.today
source: Today
zh_hans: 今天
zh_hant: 今天

# calendar.dayExpense
source: Day expense %@
zh_hans: 当日支出 %@
zh_hant: 當日支出 %@

# calendar.dayIncome
source: Day income %@
zh_hans: 当日收入 %@
zh_hant: 當日收入 %@

# calendar.empty
source: No entries on this day
zh_hans: 当天没有账目
zh_hant: 當天沒有賬目

# calendar.month
source: Month
zh_hans: 月份
zh_hant: 月份

# calendar.year
source: Year
zh_hans: 年份
zh_hant: 年份

# category.bonus
source: Bonus
zh_hans: 奖金
zh_hant: 獎金

# category.clothing
source: Clothing
zh_hans: 衣物
zh_hant: 衣物

# category.entertainment
source: Entertainment
zh_hans: 娱乐
zh_hant: 娛樂

# category.food
source: Food
zh_hans: 食物
zh_hant: 食物

# category.housing
source: Housing
zh_hans: 住宿
zh_hant: 住宿

# category.investment
source: Investment
zh_hans: 投资
zh_hant: 投資

# category.other
source: Other
zh_hans: 其他
zh_hant: 其他

# category.refund
source: Refund
zh_hans: 退款
zh_hant: 退款

# category.salary
source: Salary
zh_hans: 工资
zh_hant: 工資

# category.transport
source: Transport
zh_hans: 行程
zh_hant: 行程

# category.unselectedFallback
source: Not selected (uses Other)
zh_hans: 未选择（归入其他）
zh_hant: 未選擇（歸入其他）

# chart.type
source: Type
zh_hans: 类型
zh_hant: 類型

# command.about
source: About Romeo Daily Ledger
zh_hans: 关于罗密欧每日记账
zh_hant: 關於羅密歐每日記賬

# command.openCalendar
source: Open Calendar
zh_hans: 打开日历
zh_hant: 打開日曆

# command.openInsights
source: Open Insights
zh_hans: 打开统计
zh_hant: 打開統計

# command.openLedger
source: Open Ledger
zh_hans: 打开记账
zh_hant: 打開記賬

# command.openSettings
source: Open Settings
zh_hans: 打开设置
zh_hant: 打開設置

# editor.title
source: Edit Entry
zh_hans: 编辑账目
zh_hant: 編輯賬目

# entry.category
source: Category
zh_hans: 分类
zh_hant: 分類

# entry.expense
source: Expense
zh_hans: 支出
zh_hant: 支出

# entry.expense.short
source: Out
zh_hans: 支
zh_hant: 支

# entry.income
source: Income
zh_hans: 收入
zh_hant: 收入

# entry.income.short
source: In
zh_hans: 收
zh_hant: 收

# entry.noNote
source: No note
zh_hans: 无备注
zh_hant: 無備注

# entry.note
source: Note
zh_hans: 备注
zh_hant: 備注

# error.loadCategories
source: Unable to load categories. Please try again.
zh_hans: 分类加载失败，请重试。
zh_hant: 分類加載失敗，請重試。

# error.loadEntries
source: Unable to load entries. Please try again.
zh_hans: 账目加载失败，请重试。
zh_hant: 賬目加載失敗，請重試。

# error.loadInsights
source: Unable to load insights. Please try again.
zh_hans: 统计加载失败，请重试。
zh_hant: 統計加載失敗，請重試。

# error.saveEntry
source: Unable to save this entry. Check the amount and try again.
zh_hans: 无法保存这笔账目，请检查金额后重试。
zh_hant: 無法保存這筆賬目，請檢查金額後重試。

# error.updateEntry
source: Unable to update this entry. Check the details and try again.
zh_hans: 无法更新这笔账目，请检查内容后重试。
zh_hant: 無法更新這筆賬目，請檢查內容後重試。

# field.amount
source: Amount
zh_hans: 金额
zh_hant: 金額

# field.category
source: Category
zh_hans: 分类
zh_hant: 分類

# field.date
source: Date
zh_hans: 日期
zh_hant: 日期

# field.note
source: Note
zh_hans: 备注
zh_hant: 備注

# font.editorial
source: Editorial Font
zh_hans: 编辑字体
zh_hant: 編輯字體

# font.rounded
source: Rounded Font
zh_hans: 圆角字体
zh_hant: 圓角字體

# font.system
source: System Font
zh_hans: 系统字体
zh_hant: 系統字體

# insights.categoryChart.empty
source: There is no category data this month.
zh_hans: 这个月还没有分类数据，分类图表暂无内容。
zh_hant: 這個月還沒有分類數據，分類圖表暫無內容。

# insights.categoryChart.title
source: Category Breakdown
zh_hans: 分类构成
zh_hant: 分類構成

# insights.categorySummary.empty
source: No category insights this month.
zh_hans: 本月暂无分类统计。
zh_hant: 本月暫無分類統計。

# insights.loadError
source: Unable to load insights: %@
zh_hans: 统计加载失败：%@
zh_hant: 統計加載失敗：%@

# insights.monthlyChart.empty
source: There are no entries this month, so the monthly chart has no data.
zh_hans: 这个月还没有账目，月度图表暂无数据。
zh_hant: 這個月還沒有賬目，月度圖表暫無數據。

# insights.monthlyChart.title
source: Monthly Income and Expenses
zh_hans: 月度收支
zh_hant: 月度收支

# insights.monthOverview
source: Monthly Overview
zh_hans: 本月概览
zh_hant: 本月概覽

# insights.monthSummary
source: This month: income %@, expenses %@, net %@.
zh_hans: 本月收入 %@，支出 %@，净额 %@。
zh_hant: 本月收入 %@，支出 %@，淨額 %@。

# insights.thisMonth
source: This Month
zh_hans: 这个月
zh_hant: 這個月

# language.en
source: English
zh_hans: 英文
zh_hant: 英文

# language.zhHans
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 簡體中文

# language.zhHant
source: Traditional Chinese
zh_hans: 繁体中文
zh_hant: 繁體中文

# ledger.delete.confirmTitle
source: Delete selected entries?
zh_hans: 确认删除所选账目？
zh_hant: 確認刪除所選賬目？

# ledger.empty.message
source: Use Quick Entry above to record your first item.
zh_hans: 在上方快速记录第一笔收支。
zh_hant: 在上方快速記錄第一筆收支。

# ledger.empty.title
source: No entries today
zh_hans: 今天还没有账目
zh_hant: 今天還沒有賬目

# ledger.quickEntry
source: Quick Entry
zh_hans: 快速记一笔
zh_hant: 快速記一筆

# ledger.subtitle
source: Record every item of today's income and expenses
zh_hans: 快速记录今天的每一笔收支
zh_hant: 快速記錄今天的每一筆收支

# nav.aiAssistant.title
source: AI Assistant
zh_hans: AI 助手
zh_hant: AI 助手

# nav.calendar.title
source: Calendar
zh_hans: 日历
zh_hant: 日曆

# nav.insights.title
source: Insights
zh_hans: 统计
zh_hant: 統計

# nav.ledger.title
source: Ledger
zh_hans: 记账
zh_hant: 記賬

# nav.settings.title
source: Settings
zh_hans: 设置
zh_hant: 設置

# settings.ai.allowLedger
source: Allow AI to read ledger data
zh_hans: 允许 AI 读取账目数据
zh_hant: 允許 AI 讀取賬目數據

# settings.ai.connection
source: Connection
zh_hans: 连接
zh_hant: 連接

# settings.ai.keychainError
source: Could not access Keychain
zh_hans: 无法访问钥匙串
zh_hant: 無法訪問鑰匙串

# settings.ai.model
source: Model name
zh_hans: 模型名称
zh_hant: 模型名稱

# settings.ai.protocol
source: Protocol
zh_hans: 协议
zh_hant: 協議

# settings.ai.ready
source: Ready
zh_hans: 已就绪
zh_hant: 已就緒

# settings.ai.saved
source: Saved
zh_hans: 已保存
zh_hant: 已保存

# settings.ai.saveKey
source: Save API Key
zh_hans: 保存 API Key
zh_hant: 保存 API Key

# settings.ai.test
source: Test Connection
zh_hans: 测试连接
zh_hant: 測試連接

# settings.ai.testing
source: Testing…
zh_hans: 正在测试…
zh_hant: 正在測試…

# settings.ai.title
source: AI
zh_hans: AI 设置
zh_hant: AI 設置

# settings.appearance.motion
source: UI Motion Intensity
zh_hans: UI 动效强度
zh_hant: UI 動效強度

# settings.appearance.motionHelp
source: Choose an intensity from 0 to 100.
zh_hans: 可在 0 到 100 之间调整。
zh_hant: 可在 0 到 100 之間調整。

# settings.appearance.reduceMotionActive
source: Reduce Motion is enabled in macOS. App motion is disabled.
zh_hans: macOS 已开启“减少动态效果”，应用动效已停用。
zh_hant: macOS 已開啓“減少動態效果”，應用動效已停用。

# settings.appearance.theme
source: Theme
zh_hans: 主题
zh_hant: 主題

# settings.appearance.title
source: Appearance
zh_hans: 外观
zh_hant: 外觀

# settings.appearance.fontSize
source: Size
zh_hans: 字号
zh_hant: 字號

# settings.appearance.typography
source: Font
zh_hans: 字体
zh_hant: 字體

# settings.categories.custom
source: Custom
zh_hans: 自定义
zh_hant: 自定義

# settings.categories.editName
source: Edit category name
zh_hans: 修改分类名称
zh_hant: 修改分類名稱

# settings.categories.hidden
source: Hidden
zh_hans: 隐藏
zh_hant: 隱藏

# settings.categories.hint
source: Click to view entries, press and hold to rename; use Manage to delete multiple categories.
zh_hans: 单击查看账目，长按修改名称；点击“管理”可批量删除。
zh_hant: 單擊查看賬目，長按修改名稱；點擊「管理」可批量刪除。

# settings.categories.loadError
source: Unable to load categories: %@
zh_hans: 分类加载失败：%@
zh_hant: 分類加載失敗：%@

# settings.categories.title
source: Categories
zh_hans: 分类管理
zh_hant: 分類管理

# settings.data.error.currencyMismatch
source: The file uses %@, but this ledger uses %@.
zh_hans: 文件币种为 %@，但当前账本币种为 %@。
zh_hant: 文件幣種為 %@，但當前賬本幣種為 %@。

# settings.data.error.export
source: Unable to export the ledger.
zh_hans: 账目导出失败。
zh_hant: 賬目導出失敗。

# settings.data.error.import
source: Unable to import this file.
zh_hans: 无法导入该文件。
zh_hant: 無法導入該文件。

# settings.data.error.invalidAmount
source: An amount is invalid; use a positive number.
zh_hans: 金额无效，请使用正数。
zh_hant: 金額無效，請使用正數。

# settings.data.error.invalidData
source: The file is not a valid ledger export.
zh_hans: 该文件不是有效的账目导出文件。
zh_hant: 該文件不是有效的賬目導出文件。

# settings.data.error.invalidDate
source: A date is invalid; use yyyy-MM-dd or ISO-8601 format.
zh_hans: 日期无效，请使用 yyyy-MM-dd 或 ISO-8601 格式。
zh_hant: 日期無效，請使用 yyyy-MM-dd 或 ISO-8601 格式。

# settings.data.error.invalidKind
source: Entry type must be income or expense.
zh_hans: 账目类型必须为收入或支出。
zh_hant: 賬目類型必須為收入或支出。

# settings.data.error.malformedCSV
source: The CSV header or quoting is malformed.
zh_hans: CSV 表头或引号格式无效。
zh_hant: CSV 表頭或引號格式無效。

# settings.data.error.missingField
source: Required field '%@' is missing.
zh_hans: 缺少必填字段“%@”。
zh_hant: 缺少必填字段“%@”。

# settings.data.export.csv
source: Export CSV
zh_hans: 导出 CSV
zh_hant: 導出 CSV

# settings.data.export.help
source: Export every ledger entry. API keys and settings are never included.
zh_hans: 导出全部账目，不包含 API Key 或设置。
zh_hant: 導出全部賬目，不包含 API Key 或設置。

# settings.data.export.json
source: Export JSON
zh_hans: 导出 JSON
zh_hant: 導出 JSON

# settings.data.export.title
source: Export
zh_hans: 导出
zh_hant: 導出

# settings.data.import.button
source: Choose File…
zh_hans: 选择文件…
zh_hant: 選擇文件…

# settings.data.import.confirm
source: Import Entries
zh_hans: 确认导入
zh_hant: 確認導入

# settings.data.import.help
source: Review a JSON or CSV file before adding entries.
zh_hans: 导入 JSON 或 CSV 前先预览账目。
zh_hant: 導入 JSON 或 CSV 前先預覽賬目。

# settings.data.import.keepBoth
source: Keep Duplicates
zh_hans: 保留重复
zh_hant: 保留重複

# settings.data.import.preview.categories
source: Categories
zh_hans: 分类统计
zh_hant: 分類統計

# settings.data.import.preview.dateRange
source: Date Range
zh_hans: 日期范围
zh_hant: 日期範圍

# settings.data.import.preview.expense
source: Expense Records
zh_hans: 支出数量
zh_hant: 支出數量

# settings.data.import.preview.income
source: Income Records
zh_hans: 收入数量
zh_hant: 收入數量

# settings.data.import.preview.title
source: Import Preview
zh_hans: 导入预览
zh_hant: 導入預覽

# settings.data.import.preview.total
source: Total Records
zh_hans: 记录总数
zh_hant: 記錄總數

# settings.data.import.skipDuplicates
source: Skip Duplicates
zh_hans: 跳过重复
zh_hant: 跳過重復

# settings.data.import.strategy
source: Duplicates
zh_hans: 重复记录
zh_hant: 重復記錄

# settings.data.import.title
source: Import
zh_hans: 导入
zh_hant: 導入

# settings.data.title
source: Data
zh_hans: 数据
zh_hant: 數據

# settings.general.currency
source: Default Currency
zh_hans: 默认币种
zh_hant: 默認幣種

# settings.general.customCurrency
source: Custom 3-letter code
zh_hans: 自定义三位币种代码
zh_hant: 自定義三位幣種代碼

# settings.general.language
source: Language
zh_hans: 语言
zh_hant: 語言

# settings.general.manageCategories
source: Manage Categories
zh_hans: 管理分类
zh_hant: 管理分類

# settings.general.regional
source: Regional Preferences
zh_hans: 地区偏好
zh_hant: 地區偏好

# settings.general.title
source: General
zh_hans: 通用
zh_hant: 通用

# settings.storage.change
source: Change…
zh_hans: 更改…
zh_hant: 更改…

# settings.storage.erase
source: Erase All Entries
zh_hans: 一键抹除
zh_hant: 一鍵抹除

# settings.storage.eraseConfirm
source: Permanently erase every ledger entry? Categories, settings, and exports will be kept.
zh_hans: 永久删除所有账目？分类、设置和已导出文件将保留。
zh_hant: 永久刪除所有賬目？分類、設置和已導出文件將保留。

# settings.storage.pending
source: Quit and migrate on next launch
zh_hans: 退出并在下次启动时迁移
zh_hant: 退出並在下次啓動時遷移

# settings.storage.restore
source: Restore Default Location
zh_hans: 恢复默认位置
zh_hant: 恢復默認位置

# settings.storage.showFinder
source: Show in Finder
zh_hans: 在访达中显示
zh_hant: 在訪達中顯示

# settings.storage.title
source: Data & Storage
zh_hans: 数据与存储
zh_hant: 數據與存儲

# settings.update.available
source: A newer version is available.
zh_hans: 发现新版本。
zh_hant: 發現新版本。

# settings.update.check
source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

# settings.update.checking
source: Checking...
zh_hans: 正在检查…
zh_hant: 正在檢查…

# settings.update.current
source: Current Version
zh_hans: 当前版本
zh_hant: 當前版本

# settings.update.error.invalidResponse
source: GitHub returned an invalid response.
zh_hans: GitHub 返回了无效响应。
zh_hant: GitHub 返回了無效響應。

# settings.update.error.network
source: Unable to reach GitHub. Check your network connection.
zh_hans: 无法连接 GitHub，请检查网络连接。
zh_hant: 無法連接 GitHub，請檢查網絡連接。

# settings.update.error.noRelease
source: No release has been published yet.
zh_hans: 仓库尚未发布 Release。
zh_hant: 倉庫尚未發佈 Release。

# settings.update.error.notFound
source: The release repository could not be found.
zh_hans: 未找到更新仓库。
zh_hant: 未找到更新倉庫。

# settings.update.error.rateLimited
source: GitHub API rate limit reached. Try again later.
zh_hans: GitHub API 请求已达限额，请稍后重试。
zh_hant: GitHub API 請求已達限額，請稍後重試。

# settings.update.latest
source: Latest Version
zh_hans: 最新版本
zh_hant: 最新版本

# settings.update.openRelease
source: Open Latest Release
zh_hans: 打开最新 Release
zh_hant: 打開最新 Release

# settings.update.releasePage
source: GitHub Releases
zh_hans: GitHub Release 页面
zh_hant: GitHub Release 頁面

# settings.update.section
source: Software Update
zh_hans: 软件更新
zh_hant: 軟件更新

# settings.update.title
source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

# settings.update.upToDate
source: You are using the latest version.
zh_hans: 当前已是最新版本。
zh_hant: 當前已是最新版本。

# storage.recovery.message
source: The data migration could not be verified. Your original data is preserved and the ledger has not been opened.
zh_hans: 数据迁移未能通过验证。原始数据已保留，账本尚未打开。
zh_hant: 數據遷移未能通過驗證。原始數據已保留，賬本尚未打開。

# storage.recovery.source
source: Current data location
zh_hans: 当前数据位置
zh_hant: 當前數據位置

# storage.recovery.target
source: Pending destination
zh_hans: 待迁移位置
zh_hant: 待遷移位置

# storage.recovery.title
source: Ledger recovery required
zh_hans: 需要恢复账本
zh_hant: 需要恢復賬本

# summary.expense
source: Expense %@
zh_hans: 支出 %@
zh_hant: 支出 %@

# summary.income
source: Income %@
zh_hans: 收入 %@
zh_hant: 收入 %@

# summary.net
source: Net %@
zh_hans: 净额 %@
zh_hant: 淨額 %@

# summary.net.label
source: Net
zh_hans: 净额
zh_hant: 淨額

# state.empty
source: Empty
zh_hans: 空
zh_hant: 空

# theme.dark
source: Dark
zh_hans: 深色
zh_hant: 深色

# theme.light
source: Light
zh_hans: 浅色
zh_hant: 淺色

# theme.system
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統
